In [88]:
import pandas as pd
import numpy as np

In [89]:
Df = pd.read_csv("./Data.txt", delimiter="\t")

In [90]:
Df

           Date       Company        Person Name  Room number
0    1-Jan-2022        Avamba  Anatole Ridehalgh       4008.0
1    1-Jan-2022          Fatz    Aldrich McKevin       2002.0
2    1-Jan-2022         Leexo    Stanley Hadrill       4012.0
3        Hotels           NaN                NaN          NaN
4    1-Jan-2022        Rhyzio       Lyndell Tice       1006.0
..          ...           ...                ...          ...
190   Cleartrip           NaN                NaN          NaN
191  1-Jan-2022      Fivechat     Corabella Saye       4008.0
192  1-Jan-2022       Innojam  Leandra Potapczuk       5002.0
193  1-Jan-2022  Twitterworks    Valentia Ledson       1010.0
194      Hotels           NaN                NaN          NaN

[195 rows x 4 columns]

In [91]:
Df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         195 non-null    object
 1   Company      134 non-null    object
 2   Person Name  153 non-null    object
 3   Room number  153 non-null    float64
dtypes: float64(1), object(3)
memory usage: 6.2+ KB

In [92]:
Df.describe()

       Room number
count   153.000000
mean   3079.326797
std    1718.791186
min    1001.000000
25%    2001.000000
50%    3008.000000
75%    4010.000000
max    7002.000000

In [93]:
# Df["X"] = Df["Room number"] *2

In [94]:
Df

           Date       Company        Person Name  Room number
0    1-Jan-2022        Avamba  Anatole Ridehalgh       4008.0
1    1-Jan-2022          Fatz    Aldrich McKevin       2002.0
2    1-Jan-2022         Leexo    Stanley Hadrill       4012.0
3        Hotels           NaN                NaN          NaN
4    1-Jan-2022        Rhyzio       Lyndell Tice       1006.0
..          ...           ...                ...          ...
190   Cleartrip           NaN                NaN          NaN
191  1-Jan-2022      Fivechat     Corabella Saye       4008.0
192  1-Jan-2022       Innojam  Leandra Potapczuk       5002.0
193  1-Jan-2022  Twitterworks    Valentia Ledson       1010.0
194      Hotels           NaN                NaN          NaN

[195 rows x 4 columns]

In [95]:
Df.isna().sum()

Date            0
Company        61
Person Name    42
Room number    42
dtype: int64

In [96]:
isText = Df["Room number"].isna()
isText

0      False
1      False
2      False
3       True
4      False
       ...
190     True
191    False
192    False
193    False
194     True
Name: Room number, Length: 195, dtype: bool

In [97]:
Df["Text Data"] = np.where(isText,Df["Date"],np.NaN)

In [98]:
Df["Text Data"].value_counts()

Text Data
Hotels              13
Expedia             11
Booking              8
Cleartrip            7
Travel Agent 007     3
Name: count, dtype: int64

In [99]:
Df["Text Data"].fillna(method = "bfill", inplace=True)

/var/folders/nn/p8hlssl928zct0_lyyc81s8c0000gn/T/ipykernel_49744/3578323864.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  Df["Text Data"].fillna(method = "bfill", inplace=True)
/var/folders/nn/p8hlssl928zct0_lyyc81s8c0000gn/T/ipykernel_49744/3578323864.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  Df["Text Data"].fillna(method = "bfill", inplace=True)

In [100]:
Df.dropna(inplace=True)

In [101]:
Df.info()
Df.isna().sum()

<class 'pandas.core.frame.DataFrame'>
Index: 134 entries, 0 to 193
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         134 non-null    object
 1   Company      134 non-null    object
 2   Person Name  134 non-null    object
 3   Room number  134 non-null    float64
 4   Text Data    134 non-null    object
dtypes: float64(1), object(4)
memory usage: 6.3+ KB

Date           0
Company        0
Person Name    0
Room number    0
Text Data      0
dtype: int64

In [103]:
Df["Company"].value_counts().head(3)

Company
Leexo       3
Fivechat    3
Quinu       3
Name: count, dtype: int64

In [115]:
# Group by Df["Company"]
Df.groupby("Company")["Room number"].count()

Company
Aimbo      2
Aimbu      1
Ainyx      2
Avamba     1
Avamm      1
          ..
Youspan    1
Yozio      1
Zava       1
Zoomdog    1
Zooxo      1
Name: Room number, Length: 114, dtype: int64

In [116]:
Df["Room number"].value_counts().head()

Room number
4010.0    5
1008.0    5
2001.0    4
1004.0    4
2009.0    4
Name: count, dtype: int64

In [120]:
Df.groupby("Person Name")["Room number"].count().head()

Person Name
Abel Do            1
Adda Dive          1
Akim Chang         1
Aldrich McKevin    1
Alley Pyer         1
Name: Room number, dtype: int64

In [122]:
Df.groupby("Date")["Room number"].count()

Date
1-Jan-2022    134
Name: Room number, dtype: int64

In [124]:
Df.groupby("Text Data")["Room number"].count()

Text Data
Booking             24
Cleartrip           11
Expedia             48
Hotels              39
Travel Agent 007    12
Name: Room number, dtype: int64

In [131]:
Df.groupby("Text Data")["Room number"].count().sort_values(ascending=False)

Text Data
Expedia             48
Hotels              39
Booking             24
Travel Agent 007    12
Cleartrip           11
Name: Room number, dtype: int64